000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_066_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 a          PIC 9(5).
000007 01 b          PIC 9(5).
000008 01 c          PIC 9(5).
000009 01 ln         PIC X(17).
000010 01 tmp        PIC 9(5).
000011 01 zs         PIC Z(6).
000012 
000013 PROCEDURE DIVISION.
000014   ACCEPT ln.
000015   UNSTRING ln DELIMITED BY SPACE INTO a b c.
000016   ADD a b TO c GIVING tmp.
000017   COMPUTE c = FUNCTION MAX(a, b, c).
000018   SUBTRACT tmp FROM c.
000019   MOVE c TO zs.
000020   DISPLAY FUNCTION TRIM(zs).
000021   STOP RUN.
