IDENTIFICATION DIVISION.
PROGRAM-ID. Main.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 D PIC 9(4).
01 ANS PIC 9(4)V9(2).
01 INPUT-STRING PIC X(10).
PROCEDURE DIVISION.
ACCEPT INPUT-STRING.
MOVE FUNCTION NUMVAL(INPUT-STRING) TO D.
DISPLAY D
STOP RUN.
