IDENTIFICATION DIVISION.
PROGRAM-ID. HelloWorld.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 S PIC X(255).

PROCEDURE DIVISION.
    ACCEPT S.
    IF S = 'Hello,World!'
        DISPLAY 'AC'
    ELSE
        DISPLAY 'WA'
    END-IF.

    STOP RUN.
